In [1]:
import numpy as np
import pandas as pd

### Best way to store in database

In [2]:
df1 = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
                            'two'],
                    'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                    'baz': [1, 2, 3, 4, 5, 6],
                    'zoo': ['x', 'y', 'z', 'q', 'w', 't']})
df1

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [3]:
df1.pivot(index='foo',columns='bar',values='bar')

bar  A  B  C
foo
one  A  B  C
two  A  B  C

### Common way that financial data is stored, you need to be able to pivot the data you get so that you can store it correctly in a database.

In [5]:
df1.pivot(index='foo',columns='bar')

    baz       zoo
bar   A  B  C   A  B  C
foo
one   1  2  3   x  y  z
two   4  5  6   q  w  t

In [6]:
df = pd.DataFrame({
    "lev1": [1, 1, 1, 2, 2, 2],
    "lev2": [1, 1, 2, 1, 1, 2],
    "lev3": [1, 2, 1, 2, 1, 2],
    "lev4": [1, 2, 3, 4, 5, 6],
    "values": [0, 1, 2, 3, 4, 5]})
df

   lev1  lev2  lev3  lev4  values
0     1     1     1     1       0
1     1     1     2     2       1
2     1     2     1     3       2
3     2     1     2     4       3
4     2     1     1     5       4
5     2     2     2     6       5

In [7]:
df.pivot(index='lev1',columns=['lev2','lev3'],values='values')

lev2    1         2
lev3    1    2    1    2
lev1
1     0.0  1.0  2.0  NaN
2     4.0  3.0  NaN  5.0

In [8]:
import pandas._testing as tm

def unpivot(frame):
    N, K = frame.shape
    data = {
        "value": frame.to_numpy().ravel("F"),
        "variable": np.asarray(frame.columns).repeat(N),
        "date": np.tile(np.asarray(frame.index), K),
    }
    return pd.DataFrame(data, columns=["date", "variable", "value"])

df = unpivot(tm.makeTimeDataFrame(3))

In [9]:
df

         date variable     value
0  2000-01-03        A -0.255560
1  2000-01-04        A -0.685951
2  2000-01-05        A  0.050014
3  2000-01-03        B  2.096221
4  2000-01-04        B  0.242852
5  2000-01-05        B  0.647399
6  2000-01-03        C -1.924264
7  2000-01-04        C  0.155684
8  2000-01-05        C -0.802922
9  2000-01-03        D  1.740330
10 2000-01-04        D -2.287133
11 2000-01-05        D  0.366026

In [10]:
pivoted = df.pivot(index='date',columns='variable',values='value')
pivoted

variable           A         B         C         D
date
2000-01-03 -0.255560  2.096221 -1.924264  1.740330
2000-01-04 -0.685951  0.242852  0.155684 -2.287133
2000-01-05  0.050014  0.647399 -0.802922  0.366026

In [11]:
df["value2"] = df["value"] * 2
df

         date variable     value    value2
0  2000-01-03        A -0.255560 -0.511120
1  2000-01-04        A -0.685951 -1.371901
2  2000-01-05        A  0.050014  0.100028
3  2000-01-03        B  2.096221  4.192441
4  2000-01-04        B  0.242852  0.485703
5  2000-01-05        B  0.647399  1.294797
6  2000-01-03        C -1.924264 -3.848528
7  2000-01-04        C  0.155684  0.311369
8  2000-01-05        C -0.802922 -1.605845
9  2000-01-03        D  1.740330  3.480660
10 2000-01-04        D -2.287133 -4.574267
11 2000-01-05        D  0.366026  0.732051

In [12]:
pivoted = df.pivot(index='date',columns='variable')
pivoted

               value                                  value2            \
variable           A         B         C         D         A         B
date
2000-01-03 -0.255560  2.096221 -1.924264  1.740330 -0.511120  4.192441
2000-01-04 -0.685951  0.242852  0.155684 -2.287133 -1.371901  0.485703
2000-01-05  0.050014  0.647399 -0.802922  0.366026  0.100028  1.294797


variable           C         D
date
2000-01-03 -3.848528  3.480660
2000-01-04  0.311369 -4.574267
2000-01-05 -1.605845  0.732051

In [13]:
df = pd.DataFrame({"foo": ['one', 'one', 'two', 'two'],
                   "bar": ['A', 'A', 'B', 'C'],
                   "baz": [1, 2, 3, 4]})
df

   foo bar  baz
0  one   A    1
1  one   A    2
2  two   B    3
3  two   C    4

In [14]:
df.pivot(index='foo',columns='bar',values='baz')

ValueError: Index contains duplicate entries, cannot reshape

## Pivot Table

In [15]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo","bar", "bar", "bar", "bar"],
                   "B": ["one", "one", "one", "two", "two","one", "one", "two", "two"],
                   "C": ["small", "large", "large", "small","small", "large", "small", "small","large"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                   "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [16]:
table = pd.pivot_table(df,values='D', index=['A','B'],
                       columns=['C'],aggfunc=np.sum)
table

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

### We can also fill missing values

In [17]:
table = pd.pivot_table(df,values='D', index=['A','B'],
                       columns=['C'],aggfunc=np.sum, fill_value=0)
table

C        large  small
A   B
bar one      4      5
    two      7      6
foo one      4      1
    two      0      6

In [18]:
# Same thing can be achieved by using group by
table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
                       aggfunc={'D': np.mean,'E': [min, max, np.mean]})

table

                  D   E
               mean max      mean min
A   C
bar large  5.500000   9  7.500000   6
    small  5.500000   9  8.500000   8
foo large  2.000000   5  4.500000   4
    small  2.333333   6  4.333333   2

In [20]:
import seaborn as sns

In [21]:
flights = sns.load_dataset('flights')
flights

     year month  passengers
0    1949   Jan         112
1    1949   Feb         118
2    1949   Mar         132
3    1949   Apr         129
4    1949   May         121
..    ...   ...         ...
139  1960   Aug         606
140  1960   Sep         508
141  1960   Oct         461
142  1960   Nov         390
143  1960   Dec         432

[144 rows x 3 columns]

In [22]:
fg=flights.groupby(['year','month'])[['passengers']].sum()
fg

            passengers
year month
1949 Jan           112
     Feb           118
     Mar           132
     Apr           129
     May           121
...                ...
1960 Aug           606
     Sep           508
     Oct           461
     Nov           390
     Dec           432

[144 rows x 1 columns]

In [24]:
flights.groupby(['year']).filter(lambda x: (x['year'] == 1950).any())['passengers'].sum()

1676

In [25]:
flights_pivoted = pd.pivot_table(flights,values="passengers",index=["year"],columns='month')
flights_pivoted

month  Jan  Feb  Mar  Apr  May  Jun  Jul  Aug  Sep  Oct  Nov  Dec
year
1949   112  118  132  129  121  135  148  148  136  119  104  118
1950   115  126  141  135  125  149  170  170  158  133  114  140
1951   145  150  178  163  172  178  199  199  184  162  146  166
1952   171  180  193  181  183  218  230  242  209  191  172  194
1953   196  196  236  235  229  243  264  272  237  211  180  201
1954   204  188  235  227  234  264  302  293  259  229  203  229
1955   242  233  267  269  270  315  364  347  312  274  237  278
1956   284  277  317  313  318  374  413  405  355  306  271  306
1957   315  301  356  348  355  422  465  467  404  347  305  336
1958   340  318  362  348  363  435  491  505  404  359  310  337
1959   360  342  406  396  420  472  548  559  463  407  362  405
1960   417  391  419  461  472  535  622  606  508  461  390  432

In [27]:
flights_piv = flights.pivot(index='year',columns='month',values='passengers')
flights_piv

month  Jan  Feb  Mar  Apr  May  Jun  Jul  Aug  Sep  Oct  Nov  Dec
year
1949   112  118  132  129  121  135  148  148  136  119  104  118
1950   115  126  141  135  125  149  170  170  158  133  114  140
1951   145  150  178  163  172  178  199  199  184  162  146  166
1952   171  180  193  181  183  218  230  242  209  191  172  194
1953   196  196  236  235  229  243  264  272  237  211  180  201
1954   204  188  235  227  234  264  302  293  259  229  203  229
1955   242  233  267  269  270  315  364  347  312  274  237  278
1956   284  277  317  313  318  374  413  405  355  306  271  306
1957   315  301  356  348  355  422  465  467  404  347  305  336
1958   340  318  362  348  363  435  491  505  404  359  310  337
1959   360  342  406  396  420  472  548  559  463  407  362  405
1960   417  391  419  461  472  535  622  606  508  461  390  432

In [30]:
flights_piv.stack()

year  month
1949  Jan      112
      Feb      118
      Mar      132
      Apr      129
      May      121
              ...
1960  Aug      606
      Sep      508
      Oct      461
      Nov      390
      Dec      432
Length: 144, dtype: int64

# Pivoting Exercises
Example exercises from w3resources on pivoting in pandas

### Create a pivot table with multiple indexes
Write a Pandas program to create a Pivot table with multiple indexes from a given excel sheet (Salesdata.xlsx)

In [3]:
import pandas as pd
import numpy as np
df = pd.read_excel('SaleData.xlsx')
pivot = pd.pivot_table(df, index=['OrderDate','Region'],columns=['Manager','SalesMan','Item'],
                       values='Sale_amt', aggfunc=np.sum)
pivot

Manager            Douglas                                                  \
SalesMan              John                              Karen
Item                  Desk Home Theater Television Cell Phone Home Theater
OrderDate  Region
2018-01-06 East        NaN          NaN        NaN        NaN          NaN
2018-01-23 Central     NaN          NaN        NaN        NaN          NaN
2018-02-09 Central     NaN          NaN        NaN        NaN          NaN
2018-02-26 Central     NaN          NaN        NaN        NaN          NaN
2018-03-15 West        NaN          NaN        NaN        NaN          NaN
2018-04-01 East        NaN          NaN        NaN        NaN          NaN
2018-04-18 Central     NaN          NaN        NaN        NaN          NaN
2018-05-05 Central     NaN          NaN        NaN        NaN          NaN
2018-05-22 West        NaN          NaN        NaN        NaN          NaN
2018-06-08 East        NaN          NaN        NaN        NaN          NaN
2018-06-25 Central     NaN          NaN        NaN        NaN          NaN
2018-07-12 East        NaN          NaN        NaN        NaN          NaN
2018-07-29 East        NaN          NaN        NaN        NaN      40500.0
2018-08-15 East        NaN          NaN        NaN        NaN          NaN
2018-09-01 Central   250.0          NaN        NaN        NaN          NaN
2018-09-18 East        NaN          NaN        NaN        NaN          NaN
2018-10-05 Central     NaN          NaN        NaN        NaN          NaN
2018-10-22 East        NaN          NaN        NaN        NaN          NaN
2018-11-08 East        NaN          NaN        NaN     3375.0          NaN
2018-11-25 Central     NaN          NaN        NaN        NaN          NaN
2018-12-12 Central     NaN          NaN    80266.0        NaN          NaN
2018-12-29 East        NaN          NaN        NaN        NaN          NaN
2019-01-15 Central     NaN          NaN        NaN        NaN          NaN
2019-02-01 Central     NaN      43500.0        NaN        NaN          NaN
2019-02-18 East        NaN          NaN        NaN        NaN          NaN
2019-03-07 West        NaN          NaN        NaN        NaN          NaN
2019-03-24 Central     NaN          NaN        NaN        NaN          NaN
2019-04-10 Central     NaN          NaN        NaN        NaN          NaN
2019-04-27 East        NaN          NaN        NaN        NaN          NaN
2019-05-14 Central     NaN          NaN        NaN        NaN          NaN
2019-05-31 Central     NaN          NaN        NaN        NaN          NaN
2019-06-17 Central     NaN          NaN        NaN        NaN          NaN
2019-07-04 East        NaN          NaN        NaN        NaN          NaN
2019-07-21 Central     NaN          NaN        NaN        NaN          NaN
2019-08-07 Central     NaN          NaN        NaN        NaN          NaN
2019-08-24 West        NaN          NaN        NaN        NaN          NaN
2019-09-10 Central     NaN          NaN        NaN        NaN          NaN
2019-09-27 West        NaN          NaN        NaN        NaN          NaN
2019-10-14 West        NaN          NaN        NaN        NaN          NaN
2019-10-31 Central     NaN          NaN        NaN        NaN          NaN
2019-11-17 Central     NaN          NaN        NaN        NaN          NaN
2019-12-04 Central     NaN          NaN        NaN        NaN          NaN
2019-12-21 Central     NaN          NaN        NaN        NaN          NaN

Manager                                                     Hermann  \
SalesMan                            Michael                    Luis
Item               Video Games Home Theater Television Home Theater
OrderDate  Region
2018-01-06 East            NaN          NaN        NaN          NaN
2018-01-23 Central         NaN          NaN        NaN          NaN
2018-02-09 Central         NaN          NaN        NaN          NaN
2018-02-26 Central         NaN          NaN        NaN          NaN
2018-03-15 West            NaN          NaN        NaN          NaN
2018-04-01 East            NaN          NaN        NaN          NaN
2018-04-18 Central         NaN          NaN        NaN          NaN
2018-05-05 Central         NaN          NaN        NaN          NaN
2018-05-22 West            NaN          NaN    38336.0          NaN
2018-06-08 East            NaN          NaN        NaN          NaN
2018-06-25 Central         NaN          NaN        NaN          NaN
2018-07-12 East            NaN          NaN        NaN          NaN
2018-07-29 East            NaN          NaN        NaN          NaN
2018-08-15 East            NaN          NaN        NaN          NaN
2018-09-01 Central         NaN          NaN        NaN          NaN
2018-09-18 East            NaN          NaN        NaN          NaN
2018-10-05 Central         NaN          NaN        NaN          NaN
2018-10-22 East            NaN          NaN        NaN          NaN
2018-11-08 East            NaN          NaN        NaN          NaN
2018-11-25 Central         NaN          NaN        NaN          NaN
2018-12-12 Central         NaN          NaN        NaN          NaN
2018-12-29 East         4329.0          NaN        NaN          NaN
2019-01-15 Central         NaN          NaN        NaN          NaN
2019-02-01 Central         NaN          NaN        NaN          NaN
2019-02-18 East            NaN          NaN        NaN          NaN
2019-03-07 West            NaN          NaN        NaN          NaN
2019-03-24 Central         NaN          NaN        NaN          NaN
2019-04-10 Central         NaN          NaN        NaN          NaN
2019-04-27 East            NaN          NaN        NaN          NaN
2019-05-14 Central         NaN          NaN        NaN          NaN
2019-05-31 Central         NaN          NaN        NaN          NaN
2019-06-17 Central         NaN          NaN        NaN          NaN
2019-07-04 East            NaN          NaN        NaN          NaN
2019-07-21 Central         NaN          NaN        NaN          NaN
2019-08-07 Central         NaN          NaN        NaN          NaN
2019-08-24 West            NaN          NaN        NaN          NaN
2019-09-10 Central         NaN          NaN        NaN          NaN
2019-09-27 West            NaN          NaN        NaN          NaN
2019-10-14 West            NaN      28500.0        NaN          NaN
2019-10-31 Central         NaN          NaN        NaN          NaN
2019-11-17 Central         NaN          NaN        NaN       5500.0
2019-12-04 Central         NaN          NaN        NaN      47000.0
2019-12-21 Central         NaN          NaN        NaN          NaN

Manager                        ...       Martha                          \
SalesMan                       ...        Diana       Steven
Item               Television  ... Home Theater Home Theater Television
OrderDate  Region              ...
2018-01-06 East           NaN  ...          NaN          NaN        NaN
2018-01-23 Central        NaN  ...          NaN          NaN        NaN
2018-02-09 Central    43128.0  ...          NaN          NaN        NaN
2018-02-26 Central        NaN  ...          NaN          NaN        NaN
2018-03-15 West           NaN  ...          NaN          NaN        NaN
2018-04-01 East           NaN  ...          NaN          NaN        NaN
2018-04-18 Central        NaN  ...          NaN          NaN    89850.0
2018-05-05 Central   107820.0  ...          NaN          NaN        NaN
2018-05-22 West           NaN  ...          NaN          NaN        NaN
2018-06-08 East           NaN  ...          NaN          NaN        NaN
2018-06-25 Central        NaN  ...          NaN          NaN        NaN
2018-07-12 East           NaN  ...      14500.0          NaN        NaN
2018-07-29 East           NaN  ...          NaN          NaN        NaN
2018-08-15 East           NaN  ...          NaN          NaN        NaN
2018-09-01 Central        NaN  ...          NaN          NaN        NaN
2018-09-18 East           NaN  ...          NaN          NaN        NaN
2018-10-05 Central        NaN  ...          NaN          NaN        NaN
2018-10-22 East           NaN  ...          NaN          NaN        NaN
2018-11-08 East           NaN  ...          NaN          NaN        NaN
2018-11-25 Central        NaN  ...          NaN          NaN        NaN
2018-12-12 Central        NaN  ...          NaN          NaN        NaN
2018-12-29 East           NaN  ...          NaN          NaN        NaN
2019-01-15 Central        NaN  ...          NaN          NaN        NaN
2019-02-01 Central        NaN  ...          NaN          NaN        NaN
2019-02-18 East           NaN  ...          NaN          NaN        NaN
2019-03-07 West           NaN  ...          NaN          NaN        NaN
2019-03-24 Central        NaN  ...          NaN          NaN        NaN
2019-04-10 Central        NaN  ...          NaN          NaN    79068.0
2019-04-27 East           NaN  ...          NaN          NaN        NaN
2019-05-14 Central        NaN  ...          NaN          NaN        NaN
2019-05-31 Central        NaN  ...          NaN          NaN        NaN
2019-06-17 Central        NaN  ...          NaN          NaN        NaN
2019-07-04 East           NaN  ...          NaN          NaN        NaN
2019-07-21 Central        NaN  ...          NaN          NaN        NaN
2019-08-07 Central        NaN  ...          NaN          NaN        NaN
2019-08-24 West           NaN  ...          NaN          NaN        NaN
2019-09-10 Central        NaN  ...          NaN          NaN        NaN
2019-09-27 West           NaN  ...          NaN          NaN        NaN
2019-10-14 West           NaN  ...          NaN          NaN        NaN
2019-10-31 Central        NaN  ...          NaN          NaN    16772.0
2019-11-17 Central        NaN  ...          NaN          NaN        NaN
2019-12-04 Central        NaN  ...          NaN          NaN        NaN
2019-12-21 Central        NaN  ...          NaN      14000.0        NaN

Manager               Timothy                                            \
SalesMan                David                            Stephen
Item               Cell Phone Home Theater Television Cell Phone   Desk
OrderDate  Region
2018-01-06 East           NaN          NaN        NaN        NaN    NaN
2018-01-23 Central        NaN          NaN        NaN        NaN    NaN
2018-02-09 Central        NaN          NaN        NaN        NaN    NaN
2018-02-26 Central     6075.0          NaN        NaN        NaN    NaN
2018-03-15 West           NaN          NaN        NaN        NaN    NaN
2018-04-01 East           NaN          NaN        NaN        NaN    NaN
2018-04-18 Central        NaN          NaN        NaN        NaN    NaN
2018-05-05 Central        NaN          NaN        NaN        NaN    NaN
2018-05-22 West           NaN          NaN        NaN        NaN    NaN
2018-06-08 East           NaN          NaN        NaN        NaN    NaN
2018-06-25 Central        NaN          NaN        NaN        NaN    NaN
2018-07-12 East           NaN          NaN        NaN        NaN    NaN
2018-07-29 East           NaN          NaN        NaN        NaN    NaN
2018-08-15 East           NaN          NaN        NaN        NaN    NaN
2018-09-01 Central        NaN          NaN        NaN        NaN    NaN
2018-09-18 East           NaN          NaN        NaN        NaN    NaN
2018-10-05 Central        NaN          NaN        NaN        NaN    NaN
2018-10-22 East           NaN          NaN        NaN        NaN    NaN
2018-11-08 East           NaN          NaN        NaN        NaN    NaN
2018-11-25 Central        NaN          NaN        NaN        NaN    NaN
2018-12-12 Central        NaN          NaN        NaN        NaN    NaN
2018-12-29 East           NaN          NaN        NaN        NaN    NaN
2019-01-15 Central        NaN      23000.0        NaN        NaN    NaN
2019-02-01 Central        NaN          NaN        NaN        NaN    NaN
2019-02-18 East           NaN          NaN        NaN        NaN    NaN
2019-03-07 West           NaN          NaN        NaN        NaN    NaN
2019-03-24 Central        NaN          NaN        NaN        NaN    NaN
2019-04-10 Central        NaN          NaN        NaN        NaN    NaN
2019-04-27 East           NaN          NaN        NaN        NaN    NaN
2019-05-14 Central        NaN          NaN    63494.0        NaN    NaN
2019-05-31 Central        NaN      40000.0        NaN        NaN    NaN
2019-06-17 Central        NaN          NaN        NaN        NaN    NaN
2019-07-04 East           NaN          NaN        NaN        NaN    NaN
2019-07-21 Central        NaN          NaN        NaN        NaN    NaN
2019-08-07 Central        NaN          NaN        NaN        NaN    NaN
2019-08-24 West           NaN          NaN        NaN        NaN  375.0
2019-09-10 Central        NaN          NaN     8386.0        NaN    NaN
2019-09-27 West           NaN          NaN        NaN    17100.0    NaN
2019-10-14 West           NaN          NaN        NaN        NaN    NaN
2019-10-31 Central        NaN          NaN        NaN        NaN    NaN
2019-11-17 Central        NaN          NaN        NaN        NaN    NaN
2019-12-04 Central        NaN          NaN        NaN        NaN    NaN
2019-12-21 Central        NaN          NaN        NaN        NaN    NaN

Manager
SalesMan
Item               Home Theater Television
OrderDate  Region
2018-01-06 East             NaN        NaN
2018-01-23 Central          NaN        NaN
2018-02-09 Central          NaN        NaN
2018-02-26 Central          NaN        NaN
2018-03-15 West             NaN    67088.0
2018-04-01 East             NaN        NaN
2018-04-18 Central          NaN        NaN
2018-05-05 Central          NaN        NaN
2018-05-22 West             NaN        NaN
2018-06-08 East             NaN        NaN
2018-06-25 Central          NaN        NaN
2018-07-12 East             NaN        NaN
2018-07-29 East             NaN        NaN
2018-08-15 East             NaN        NaN
2018-09-01 Central          NaN        NaN
2018-09-18 East             NaN        NaN
2018-10-05 Central          NaN        NaN
2018-10-22 East             NaN        NaN
2018-11-08 East             NaN        NaN
2018-11-25 Central          NaN        NaN
2018-12-12 Central          NaN        NaN
2018-12-29 East             NaN        NaN
2019-01-15 Central          NaN        NaN
2019-02-01 Central          NaN        NaN
2019-02-18 East             NaN        NaN
2019-03-07 West          3500.0        NaN
2019-03-24 Central          NaN        NaN
2019-04-10 Central          NaN        NaN
2019-04-27 East             NaN        NaN
2019-05-14 Central          NaN        NaN
2019-05-31 Central          NaN        NaN
2019-06-17 Central          NaN        NaN
2019-07-04 East             NaN        NaN
2019-07-21 Central          NaN        NaN
2019-08-07 Central          NaN        NaN
2019-08-24 West             NaN        NaN
2019-09-10 Central          NaN        NaN
2019-09-27 West             NaN        NaN
2019-10-14 West             NaN        NaN
2019-10-31 Central          NaN        NaN
2019-11-17 Central          NaN        NaN
2019-12-04 Central          NaN        NaN
2019-12-21 Central          NaN        NaN

[43 rows x 32 columns]

### Create a Pivot table and find the total sale amount region wise, manager wise.

In [38]:
pivot = pd.pivot_table(df, index=['Region','Manager'],values='Sale_amt',aggfunc=np.sum)
pivot

                 Sale_amt
Region  Manager
Central Douglas  124016.0
        Hermann  365108.5
        Martha   199690.0
        Timothy  140955.0
East    Douglas   48204.0
        Martha   272803.0
West    Douglas   66836.0
        Timothy   88063.0

### Create a Pivot table and find the total sale amount region wise, manager wise, sales man wise.

In [39]:
pivot = pd.pivot_table(df, index=['Region','Manager','SalesMan'],values='Sale_amt',aggfunc=np.sum)
pivot

                           Sale_amt
Region  Manager SalesMan
Central Douglas John       124016.0
        Hermann Luis       206373.0
                Shelli      33698.0
                Sigal      125037.5
        Martha  Steven     199690.0
        Timothy David      140955.0
East    Douglas Karen       48204.0
        Martha  Alexander  236703.0
                Diana       36100.0
West    Douglas Michael     66836.0
        Timothy Stephen     88063.0

### Create a Pivot table and find the item wise unit sold.

In [41]:
pivot = pd.pivot_table(df, index=['Item'],values='Units',aggfunc=np.sum)
pivot

              Units
Item
Cell Phone    278.0
Desk           10.0
Home Theater  722.0
Television    716.0
Video Games   395.0

### Create a Pivot table and find the region wise total sale

In [42]:
pivot = pd.pivot_table(df, index=['Region'],values='Sale_amt',aggfunc=np.sum)
pivot

         Sale_amt
Region
Central  829769.5
East     321007.0
West     154899.0

### Create a Pivot table and find the region wise, item wise unit sold.

In [43]:
pivot = pd.pivot_table(df, index=['Region','Item'],values='Units',aggfunc=np.sum)
pivot

                      Units
Region  Item
Central Cell Phone     27.0
        Desk            7.0
        Home Theater  424.0
        Television    498.0
        Video Games   243.0
East    Cell Phone    175.0
        Home Theater  234.0
        Television    130.0
        Video Games   152.0
West    Cell Phone     76.0
        Desk            3.0
        Home Theater   64.0
        Television     88.0

###  Create a Pivot table and count the manager wise sale and mean value of sale amount.

In [45]:
# 7
pivot = pd.pivot_table(df, index=['Manager'],values='Sale_amt',aggfunc=[len,np.mean])
pivot

             len          mean
        Sale_amt      Sale_amt
Manager
Douglas        8  29882.000000
Hermann       12  30425.708333
Martha        14  33749.500000
Timothy        9  25446.444444

### Create a Pivot table and find manager wise, salesman wise total sale and also display the sum of all sale amount at the bottom

In [49]:
pivot = pd.pivot_table(df, index=['Manager','SalesMan'],values='Sale_amt',aggfunc=[sum],margins=True)
pivot

                         sum
                    Sale_amt
Manager SalesMan
Douglas John        124016.0
        Karen        48204.0
        Michael      66836.0
Hermann Luis        206373.0
        Shelli       33698.0
        Sigal       125037.5
Martha  Alexander   236703.0
        Diana        36100.0
        Steven      199690.0
Timothy David       140955.0
        Stephen      88063.0
All                1305675.5

### Create a Pivot table and find the total sale amount region wise, manager wise, sales man wise where Manager = "Douglas"

You can query pivot tables to do the sql equivalent of where

In [54]:
pivot = pd.pivot_table(df, index=['Region','Manager','SalesMan'],values='Sale_amt')
pivot.query('Manager == ["Douglas"]')

                              Sale_amt
Region  Manager SalesMan
Central Douglas John      41338.666667
East    Douglas Karen     16068.000000
West    Douglas Michael   33418.000000

### Create a Pivot table and find the region wise Television and Home Theater sold.

In [56]:
pivot = pd.pivot_table(df, index=['Region','Item'],values='Sale_amt')
pivot.query('Item == ["Television","Home Theater"]')

                          Sale_amt
Region  Item
Central Home Theater  26500.000000
        Television    66289.333333
East    Home Theater  23400.000000
        Television    77870.000000
West    Home Theater  16000.000000
        Television    52712.000000

### Create a Pivot table and find the maximum sale value of the items.

In [57]:
pivot = pd.pivot_table(df, index=['Item'],values='Sale_amt',aggfunc=[max])
pivot

                   max
              Sale_amt
Item
Cell Phone     21600.0
Desk             625.0
Home Theater   47000.0
Television    113810.0
Video Games     5616.0

### Create a Pivot table and find the minimum sale value of the items

In [58]:
pivot = pd.pivot_table(df, index=['Item'],values='Sale_amt',aggfunc=[min])
pivot

                  min
             Sale_amt
Item
Cell Phone     3375.0
Desk            250.0
Home Theater   2000.0
Television     8386.0
Video Games     936.0

###  Create a Pivot table and find the maximum and minimum sale value of the items

In [59]:
pivot = pd.pivot_table(df, index=['Item'],values='Sale_amt',aggfunc=[min,max])
pivot

                  min       max
             Sale_amt  Sale_amt
Item
Cell Phone     3375.0   21600.0
Desk            250.0     625.0
Home Theater   2000.0   47000.0
Television     8386.0  113810.0
Video Games     936.0    5616.0